<?php 

// Задача 16:
// Въведено е трицифрено естествено число от вида abc.
// Трябва да се провери дали:
// ако a = b = c - Изход: цифрите са равни;
// ако a>b>c - Изход: цифрите са във възходящ ред;
// ако a<b<c цифрите са в низходящ ред;
// и изход: цифрите са ненаредени, за неописаните случаи.
// Да се състави програма, която извежда резултата от проверката за
// наредба на цифрите в числото.
// Пример: 345
// Изход: възходящ ред.


	$number = $_GET['number'];
	$number+=0;

	if (!empty($number) && is_numeric($number) && ($number>= 100 && $number <= 999)) {

		$a = $number / 100;
		$a = (int)$a;
		$b = ($number / 10) % 10;
		$c = ($number % 10);

		if (($a > $b) && ($b > $c)) {
			echo "Цифрите са в низходящ ред.";
		} elseif (($a < $b) && ( $b < $c)) {
			echo "Цифрите са във възходящ ред.";
		} elseif (($a === $b) && ( $b === $c)) {
			echo "Цифрите са равни.";
		} else {
			echo "Цифрите са ненаредени.";
		}

	} else {
		echo "Попълнете полето правилно/ Въведете трицифрено число.";
	}

?>