<?php 

// Задача 15:
// Да се състави програма, която въвежда естествено число от интервала
// [0..24].
// Програма да изведе съответстващо съобщение съобразно въведения
// час.
// Периодите са:
// [18..4] - Добър вечер;
// [4..9] - Добро утро;
// [9..18] - Добър ден
// Пример: 10
// Изход: Добър ден


	$hours = $_GET['hours'];
	$hours+=0;

	if (!empty($hours) && is_int($hours) && $hours >= 0 && $hours <= 24) {

		if ($hours >= 4 && $hours <= 9) {
			echo "Добро утро.";
		} elseif ($hours > 9 && $hours <= 18) {
			echo "Добър ден.";
		} else {
			echo "Добър вечер.";
		}

	} else {

		echo "<h4>Моля, попълнете полетo / Въведе правилната стойност.</h4>";

	}
?>