<?php include "header.php";?>

<main>
	<section id="main-slider">
	    <div class="container">
	    	<div class="row">
		    	<h3 class="reservation">Благодарим Ви за резервацията,</h3>

				<p class="reservation"> 
					Моля имайте предвид, че направената от вас резервация ще важи до 30 МИНУТИ преди началото на прожекцията. След този срок вашата резервация автоматично ще отпадне. Като използвам онлайн системата за резервиране на билети приемам и се съгласявам, че на Синема Сити България ЕООД. (по-нататък кинокомплекса) като оператор на кинокомплексите на Синема Сити е разрешено да обработва и съхранява моите лични данни с цел регистриране и идентифициране на моята резервация/закупуване на билети съобразно действащото законодателство на Република България. Кинокомплексът няма да предоставя съхраняваните данни на трети страни и няма да ги използва за промоции или директен маркетинг.
				</p>
	    	</div>
	    </div>
	</section>
	<section class="container">
		<div class="row">
		    <div class="col-xs-12 col-md-9 main">

		      <?php include "inc/tab.php"; ?>	    	

			</div><!-- col-md-9 -->

			<aside class="col-xs-12 col-md-3">
				<?php include "aside.php"; ?>
			</aside>
		</div> <!-- row -->
	</section> 
</main>


<?php include "footer.php"; ?>