<?php 

// Задача 14:
// Да се състави програма, която по въведени координати на 2 позиции
// от шахматната дъска извежда отговор дали са оцветени в еднакъв или
// различен цвят.
// Шахматната дъска е квадратна.
// Въвеждат се две двойки числа от интервала [1..8].
// Пример: 2 2 3 2
// Изход: Позициите са с различен цвят


	$x1 = $_GET['x1'];
	$x1 += 0;

	$y1 = $_GET['y1'];
	$y1 += 0;

	$x2 = $_GET['x2'];
	$x2 += 0;

	$y2 = $_GET['y2'];
	$y2 += 0;

	$position1 = ($x1 + $y1) % 2;
	$position2 = ($x2 + $y2) % 2;

	if (isset($x1) && isset($x2) && isset($y1) && isset($y2) && ($x1 >= 1 && $x1 <= 8) && ($x2 >= 1 && $x2 <= 8) && ($y1 >= 1 && $y1 <= 8) && ($y2 >= 1 && $y2 <= 8) && is_numeric($x1) && is_numeric($x2) && is_numeric($y1) && is_numeric($y2)) {

		if (($position1 === 0 && $position2 === 0) || ($position1 != 0 && $position2 != 0)) {
			echo "Позициите са еднакъв цвят.";
		} else {
			echo "Позициите са с различен цвят.";
		}
		
	} else {
		echo "Моля, попълнете полетата. Въведете числo от 1 до 8.";
	}
?>