<?php include 'inc/header.php'; ?>

		<div class="wrapper">

			<div class="breadcrumbs">
				<ul>
					<li><a href="index.html" title="Начало">Начало / </a></li>
					<li>За мен</li>
				</ul>	
			</div>

			<section class="about">
				<article>
					<h2><За мен/></h2>

					<div class="photo">	
						<img src="images/about.jpg" alt="Panayot Angrev" width="150" height="150">
					</div>

					<p> Здравейте, моята история с програмирането започна преди доста години от един магазин на бул. "Княгиня Мария Луиза" в София. Сега в него продават дрехи втора употреба, но тогава той беше по-различен от всички останали. В него продаваха компютър „Правец” – голям, тежък и всичко на екрана беше със зелени букви. Както повечето семейства тогава, и моето не можеше да си позволи да има компютър. Мечтите обаче бяха и продължават да са безплатни. Едва ли мога да кажа колко време съм изкарал в магазина в мечти, че един ден ще имам същия компютър и ще мога да правя същите тези игри, които се пускаха с едни големи дискети. </p>

					<p>И тъй като животът често ни кара да забравяме мечтите си, години по-късно аз вече учех за инженер-химик, а не за софтуерен инженер. След завършването на университета взех и диплома по финанси. Работата ми пък беше в съвсем друга насока. Дълги години работя като журналист. Заемал съм различни позиции във водещите вестници в България – „Дневник”, „Капитал”, „Сега”. Ресорите, за които през годините отговарях са свързани основно с националната сигурност, отбраната и дейността на Народното събрание. </p>

					<p>Но хубавото на мечтите е, че от теб зависи дали ще се сбъднат. Преди 5 години започнах с опитите да правя статични страници с HTML и CSS. И колкото повече четях и пишех код толкова повече исках да науча всичко. Дори работата по 12 часа не ме спираше като се прибера да започна да уча нова технология или да изучавам нов език за програмиране. Тогава си дадох сметка, че ако желаеш нещо толкова много, ако не ти пречи умората от работата и отделяш всяка една минута от свободното си време за него, то тогава явно си сбъркал професията си. Така се стигна да търсенето на начин да създам солидна основа за натрупване на знания. Преминах през няколко курса в Софтуерния университет, където изучавах HTML, CSS, C#. По-късно, освен няколко сайта, направих и първото си приложение за Андроид. </p>

					<p>Преди няколко месеца открих IT talents и смятам, че най-накрая намерих правилния път, за да започна работа като програмист. За много мои колеги е странно да захвърлиш 20-годишна кариера и име, но за мен е напълно нормално да следваш мечтите си. </p>


				</article>
			</section>
		</div>
<?php include 'inc/footer.php'; ?>